//      Даны два положительных целых числа (N, M) в десятичном виде.
//      Вам необходимо подсчитать расстояние Хэмминга между этими двумя числами.

package com.gmail.vasyl.gromov;

import java.util.Scanner;

public class Main {

    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);
        int a;
        int b;
        System.out.println("Enter two decimal numbers: ");
        a = sc.nextInt();
        b = sc.nextInt();

    }

//    public static int getHammingDistance (int a, int b){
//        int hammingDistance;
//
//
//        return hammingDistance;
//    }
}
